<!-- terraform-plan-dev -->
## 📋 Terraform Plan — `dev`

| | |
|---|---|
| **Status** | 🟡 Changes detected |
| **Environment** | `dev` |
| **Commit** | [`3ad34641`](https://github.com/YilingCAI/python-angular-project1-infra2/commit/3ad3464167055c233798676215ed2a8f9f8296cd) |
| **Workflow run** | [#29](https://github.com/YilingCAI/python-angular-project1-infra2/actions/runs/23254817864) |
| **Mode** | Speculative (no state lock) |

### 📊 Change summary

| Change type | Count |
|---|:---:|
| 🟢 To add | 94 |
| 🟡 To change | 0 |
| 🔴 To destroy | 0 |

### 📝 Affected resources

`aws_cloudwatch_dashboard.main` — **created**
`aws_kms_alias.secrets` — **created**
`aws_kms_key.secrets` — **created**
`aws_kms_key_policy.secrets` — **created**
`aws_secretsmanager_secret.jwt_secret` — **created**
`aws_secretsmanager_secret_version.jwt_secret` — **created**
`module.alb.aws_lb.main` — **created**
`module.alb.aws_lb_target_group.app` — **created**
`module.alb.aws_lb_target_group.frontend` — **created**
`module.alb.aws_s3_bucket.alb_logs` — **created**
`module.alb.aws_s3_bucket_lifecycle_configuration.alb_logs` — **created**
`module.alb.aws_s3_bucket_logging.alb_logs` — **created**
`module.alb.aws_s3_bucket_policy.alb_logs` — **created**
`module.alb.aws_s3_bucket_public_access_block.alb_logs` — **created**
`module.alb.aws_s3_bucket_server_side_encryption_configuration.alb_logs` — **created**
`module.alb.aws_s3_bucket_versioning.alb_logs` — **created**
`module.argocd.helm_release.argocd` — **created**
`module.argocd.kubectl_manifest.bootstrap_app[0]` — **created**
`module.argocd.kubernetes_namespace_v1.argocd` — **created**
`module.eks.aws_cloudwatch_log_group.eks` — **created**
`module.eks.aws_eks_access_entry.admins["arn:aws:iam::284464749723:user/cloud_user"]` — **created**
`module.eks.aws_eks_access_policy_association.admins["arn:aws:iam::284464749723:user/cloud_user"]` — **created**
`module.eks.aws_eks_addon.coredns` — **created**
`module.eks.aws_eks_addon.eks_pod_identity_agent` — **created**
`module.eks.aws_eks_addon.kube_proxy` — **created**
`module.eks.aws_eks_addon.vpc_cni` — **created**
`module.eks.aws_eks_cluster.main` — **created**
`module.eks.aws_eks_node_group.main` — **created**
`module.eks.aws_iam_openid_connect_provider.eks` — **created**
`module.eks.aws_iam_policy.alb_controller` — **created**
`module.eks.aws_iam_policy.app_secrets` — **created**
`module.eks.aws_iam_policy.cluster_autoscaler` — **created**
`module.eks.aws_iam_role.alb_controller` — **created**
`module.eks.aws_iam_role.app_secrets` — **created**
`module.eks.aws_iam_role.cluster_autoscaler` — **created**
`module.eks.aws_iam_role.eks_cluster` — **created**
`module.eks.aws_iam_role.eks_nodes` — **created**
`module.eks.aws_iam_role_policy_attachment.alb_controller` — **created**
`module.eks.aws_iam_role_policy_attachment.app_secrets` — **created**
`module.eks.aws_iam_role_policy_attachment.cluster_autoscaler` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_cloudwatch_agent` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_cluster_policy` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_cni_policy` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_ecr_readonly` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_ssm` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller` — **created**
`module.eks.aws_iam_role_policy_attachment.eks_worker_node_policy` — **created**
`module.eks.aws_kms_alias.eks` — **created**
`module.eks.aws_kms_key.eks` — **created**
`module.eks.aws_kms_key_policy.eks` — **created**
`module.helm_addons.helm_release.aws_load_balancer_controller` — **created**
`module.helm_addons.helm_release.cluster_autoscaler` — **created**
`module.helm_addons.helm_release.metrics_server` — **created**
`module.helm_addons.helm_release.secrets_provider_aws` — **created**
`module.helm_addons.helm_release.secrets_store_csi` — **created**
`module.network.aws_cloudwatch_log_group.flow_logs` — **created**
`module.network.aws_default_security_group.default` — **created**
`module.network.aws_eip.nat[0]` — **created**
`module.network.aws_flow_log.main` — **created**
`module.network.aws_iam_role.flow_logs` — **created**
`module.network.aws_iam_role_policy.flow_logs` — **created**
`module.network.aws_internet_gateway.main` — **created**
`module.network.aws_kms_key.flow_logs` — **created**
`module.network.aws_kms_key_policy.flow_logs` — **created**
`module.network.aws_nat_gateway.main[0]` — **created**
`module.network.aws_route_table.private[0]` — **created**
`module.network.aws_route_table.public` — **created**
`module.network.aws_route_table_association.private[0]` — **created**
`module.network.aws_route_table_association.private[1]` — **created**
`module.network.aws_route_table_association.public[0]` — **created**
`module.network.aws_route_table_association.public[1]` — **created**
`module.network.aws_security_group.alb` — **created**
`module.network.aws_security_group.eks_nodes` — **created**
`module.network.aws_security_group.rds` — **created**
`module.network.aws_subnet.database[0]` — **created**
`module.network.aws_subnet.database[1]` — **created**
`module.network.aws_subnet.private[0]` — **created**
`module.network.aws_subnet.private[1]` — **created**
`module.network.aws_subnet.public[0]` — **created**
`module.network.aws_subnet.public[1]` — **created**
`module.network.aws_vpc.main` — **created**
`module.rds.aws_cloudwatch_log_group.rds` — **created**
`module.rds.aws_db_instance.main` — **created**
`module.rds.aws_db_subnet_group.main` — **created**
`module.rds.aws_iam_role.rds_monitoring` — **created**
`module.rds.aws_iam_role_policy_attachment.rds_monitoring` — **created**
`module.rds.aws_kms_alias.rds` — **created**
`module.rds.aws_kms_key.cloudwatch_logs` — **created**
`module.rds.aws_kms_key.rds` — **created**
`module.rds.aws_kms_key_policy.cloudwatch_logs` — **created**
`module.rds.aws_kms_key_policy.rds` — **created**
`module.rds.aws_secretsmanager_secret.db_password` — **created**
`module.rds.aws_secretsmanager_secret_version.db_password` — **created**
`module.rds.random_password.db_password` — **created**

### 💰 Infracost estimate

| | |
|---|---|
| **Estimated monthly cost** | `$174.32/mo (diff: +$174.32/mo)` |


<details>
<summary>📄 Full plan output (click to expand)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "node_cpu_utilization",
                                  + "ClusterName",
                                  + "mypythonproject1-dev-eks",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "node_memory_utilization",
                                  + "ClusterName",
                                  + "mypythonproject1-dev-eks",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + "AWS/RDS",
                                  + "CPUUtilization",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "DatabaseConnections",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-1"
                          + stat    = "Average"
                          + title   = "Infrastructure Metrics"
                        }
                      + type       = "metric"
                    },
                  + {
                      + properties = {
                          + query  = "fields @timestamp, @message | stats count() by bin(5m)"
                          + region = "us-east-1"
                          + title  = "Log Insights"
                        }
                      + type       = "log"
                    },
                ]
            }
        )
      + dashboard_name = "mypythonproject1-dev-dashboard"
      + id             = (known after apply)
      + region         = "us-east-1"
    }

  # aws_kms_alias.secrets will be created
  + resource "aws_kms_alias" "secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/mypythonproject1-dev-secrets"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.secrets will be created
  + resource "aws_kms_key" "secrets" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for Secrets Manager"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "us-east-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "mypythonproject1-dev-secrets-key"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "mypythonproject1-dev-secrets-key"
          + "Project"     = "mypythonproject1-dev"
        }
    }

  # aws_kms_key_policy.secrets will be created
  + resource "aws_kms_key_policy" "secrets" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = (known after apply)
      + region                             = "us-east-1"
    }

  # aws_secretsmanager_secret.jwt_secret will be created
  + resource "aws_secretsmanager_secret" "jwt_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "mypythonproject1-dev-jwt-secret-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + region                         = "us-east-1"
      + tags                           = {
          + "Name" = "mypythonproject1-dev-jwt-secret"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "mypythonproject1-dev-jwt-secret"
          + "Project"     = "mypythonproject1-dev"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.jwt_secret will be created
  + resource "aws_secretsmanager_secret_version" "jwt_secret" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.alb.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.alb.data.aws_elb_service_account.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_elb_service_account" "main" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + region = (known after apply)
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "mypythonproject1-dev-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "mypythonproject1-dev-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "mypythonproject1-dev-alb"
          + "Project"     = "mypythonproject1-dev"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb-logs"
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_target_group.app will be created
  + resource "aws_lb_target_group" "app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "app-"
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "mypythonproject1-dev-tg"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "mypythonproject1-dev-tg"
          + "Project"     = "mypythonproject1-dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group.frontend will be created
  + resource "aws_lb_target_group" "frontend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "fe-"
      + port                               = 4200
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "mypythonproject1-dev-frontend-tg"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "mypythonproject1-dev-frontend-tg"
          + "Project"     = "mypythonproject1-dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_s3_bucket.alb_logs will be created
  + resource "aws_s3_bucket" "alb_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "mypythonproject1-dev-alb-logs-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "mypythonproject1-dev-alb-logs"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "mypythonproject1-dev-alb-logs"
          + "Project"     = "mypythonproject1-dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.alb.aws_s3_bucket_lifecycle_configuration.alb_logs will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "alb_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "archive-old-logs"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }

  # module.alb.aws_s3_bucket_logging.alb_logs will be created
  + resource "aws_s3_bucket_logging" "alb_logs" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + region        = "us-east-1"
      + target_bucket = (known after apply)
      + target_prefix = "access-logs/"
    }

  # module.alb.aws_s3_bucket_policy.alb_logs will be created
  + resource "aws_s3_bucket_policy" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.alb.aws_s3_bucket_public_access_block.alb_logs will be created
  + resource "aws_s3_bucket_public_access_block" "alb_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
    }

  # module.alb.aws_s3_bucket_server_side_encryption_configuration.alb_logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.alb.aws_s3_bucket_versioning.alb_logs will be created
  + resource "aws_s3_bucket_versioning" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.argocd.helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = true
      + chart                      = "argo-cd"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 600
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "applicationSet":
                  "replicas": 1
                "configs":
                  "cm":
                    "accounts.admin": "login,apiKey"
                    "admin.enabled": "true"
                    "application.resourceTrackingMethod": "annotation"
                    "timeout.reconciliation": "180s"
                  "params":
                    "server.insecure": "true"
                  "rbac":
                    "policy.default": "role:readonly"
                "global":
                  "domain": "argocd.8s-mypythonproject1d-c66717b353-1150419392.us-east-1.elb.amazonaws.com.nip.io"
                "redis":
                  "resources":
                    "limits":
                      "cpu": "200m"
                      "memory": "128Mi"
                    "requests":
                      "cpu": "50m"
                      "memory": "64Mi"
                "repoServer":
                  "replicas": 1
                  "resources":
                    "limits":
                      "cpu": "500m"
                      "memory": "512Mi"
                    "requests":
                      "cpu": "100m"
                      "memory": "256Mi"
                "server":
                  "ingress":
                    "annotations":
                      "alb.ingress.kubernetes.io/group.name": "mypythonproject1-dev-argocd"
                      "alb.ingress.kubernetes.io/listen-ports": "[{\"HTTP\":80}]"
                      "alb.ingress.kubernetes.io/scheme": "internet-facing"
                      "alb.ingress.kubernetes.io/target-type": "ip"
                    "enabled": true
                    "hosts":
                    - "argocd.8s-mypythonproject1d-c66717b353-1150419392.us-east-1.elb.amazonaws.com.nip.io"
                    "ingressClassName": "alb"
                  "replicas": 1
                  "resources":
                    "limits":
                      "cpu": "500m"
                      "memory": "512Mi"
                    "requests":
                      "cpu": "100m"
                      "memory": "128Mi"
            EOT,
        ]
      + verify                     = false
      + version                    = "7.8.3"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # module.argocd.kubectl_manifest.bootstrap_app[0] will be created
  + resource "kubectl_manifest" "bootstrap_app" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Application"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "mypythonproject1-dev-apps"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              finalizers:
              - resources-finalizer.argocd.argoproj.io
              labels:
                environment: dev
              name: mypythonproject1-dev-apps
              namespace: argocd
            spec:
              destination:
                namespace: app
                server: https://kubernetes.default.svc
              project: default
              source:
                path: apps/dev
                repoURL: https://github.com/YilingCAI/python-angular-project1-gitops.git
                targetRevision: main
              syncPolicy:
                automated:
                  prune: true
                  selfHeal: true
                syncOptions:
                - CreateNamespace=true
                - ServerSideApply=true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.argocd.kubernetes_namespace_v1.argocd will be created
  + resource "kubernetes_namespace_v1" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "environment"                  = "dev"
            }
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.eks.data.aws_iam_policy_document.alb_controller_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_iam_policy_document.cluster_autoscaler_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_iam_policy_document.secrets_csi_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "secrets_csi_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:app:app-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.eks.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.eks.data.tls_certi

... (truncated — see full output in workflow run)
```
</details>

> _Triggered by @YilingCAI · Wed, 18 Mar 2026 16:16:34 GMT_